x = input('Введите строку маленькими латинскими буквами: ')
# y = list(x)
l = len(x) # длина строки
a = e = i = o = u = 0 # счетчики соответственной буквы
sogl = gl = 0 # согласные/гласные

print()
# подсчет кол-ва гласных
for k in (range(l)): # перебор символов в строке от первого до последнего
     if x[k] == 'a':
        a += 1
     elif x[k] == 'e':
        e += 1
     elif x[k] == 'i':
        i += 1
     elif x[k] == 'o':
        o += 1
     elif x[k] == 'u':
        u += 1
# проверка и вывод отсутствия или кол-ва гласных
if a == 0:
    print('Наличие буквы "a" -> false')
else:
    print('Количество букв "a" = ', a)
if e == 0:
    print('Наличие буквы "e" -> false')
else:
    print('Количество букв "e" = ', e)
if i == 0:
    print('Наличие буквы "i" -> false')
else:
    print('Количество букв "i" = ', i)
if o == 0:
    print('Наличие буквы "o" -> false')
else:
    print('Количество букв "o" = ', o)
if u == 0:
    print('Наличие буквы "u" -> false')
else:
    print('Количество букв "u" = ', u)

print()
# подсчет кол-ва гласных и согласных
gl = a + e + i + o + u
print('Количество гласных = ', gl)
sogl = l - gl
print('Количество согласных = ', sogl)







